Repository: kenichisutan/canadian-budget-en-fr-sentiment-analysis
Catalog: data/corpora/federal-budget/budget-2025-en-budget-2025-fr.tmx
Source language: en_en
Languages: fr_fr

source: That it is expedient to amend the Select Luxury Items Tax Act as follows:
fr_fr: Il y a lieu de modifier la Loi sur la taxe sur certains biens de luxe , comme suit :

source: 1 (1) The Select Luxury Items Tax Act is amended by adding the following after section 1: Non-application Marginal note: Tax not payable – aircraft and vessels 1.1 Despite anything in this Act, tax under Division 2 of Part 1 in respect of a subject aircraft or subject vessel is not payable if, in the absence of this section, the tax would become payable under that Division after Budget Day.
fr_fr: 1 (1) La Loi sur la taxe sur certains biens de luxe est modifiée par adjonction, après l'article 1, de ce qui suit : Non-application Note marginale : Taxe non payable – aéronefs et navires 1.1 Malgré les autres dispositions de la présente loi, la taxe prévue à la section 2 de la partie 1 relative à un aéronef assujetti ou à un navire assujetti n'est pas payable si, compte non tenu du présent article, elle devenait payable en application de cette section après le jour du budget.

source: 2 (1) Subsection 50(6) of the Act is replaced by the following: Marginal note: Registration not required (6) Despite subsection (3), a person is not required to be registered for the purposes of this Act as a vendor in respect of (a) subject aircraft or subject vessels after Budget Day; or (b) a type of subject item if the person is a prescribed person.
fr_fr: 2 (1) Le paragraphe 50(6) de la même loi est remplacé par ce qui suit : Note marginale : Inscription non obligatoire (6) Malgré le paragraphe (3), une personne n'est pas tenue d'être inscrite pour l'application de la présente loi à titre de vendeur relativement : a) aux aéronefs assujettis ou aux navires assujettis après le jour du budget; b) à un type de bien assujetti si la personne est une personne visée par règlement.

source: 3 (1) The Act is amended by adding the following after section 52: Marginal note: Registrations cancelled – aircraft and vessels 52.1 Every registration under this Division in respect of subject aircraft or subject vessels is cancelled on February 1, 2028.
fr_fr: 3 (1) La même loi est modifiée par adjonction, après l'article 52, de ce qui suit : Note marginale : Inscriptions annulées – aéronefs et navires 52.1 Les inscriptions en application de la présente section relativement aux aéronefs assujettis ou aux navires assujettis sont annulées le 1 er février 2028.

source: 4 (1) Section 55 of the Act is amended by adding the following after subsection (3): Marginal note: No requirement to file – aircraft and vessels (3.1) Despite subsection (1), a return for a reporting period of a person that begins after December 2025 is not required to be filed if (a) the person is registered under this Division as a vendor in respect of subject aircraft or subject vessels; (b) the person is neither registered nor required to be registered under this Division in respect of subject vehicles; and (c) no tax becomes payable by the person during the reporting period.
fr_fr: 4 (1) L'article 55 de la même loi est modifié par adjonction, après le paragraphe (3), de ce qui suit : Note marginale : Production non requise – aéronefs et navires (3.1) Malgré le paragraphe (1), une déclaration pour une période de déclaration d'une personne qui commence après décembre 2025 n'a pas à être produite si, à la fois : a) la personne est inscrite en application de la présente section à titre de vendeur relativement aux aéronefs assujettis ou aux navires assujettis; b) la personne n'est ni inscrite ni tenue de l'être en application de la présente section relativement aux véhicules assujettis; c) aucune taxe ne devient payable par la personne au cours de la période de déclaration.

source: (2) Subsection 55(3.1) of the Act, as enacted by subsection (1), is repealed.
fr_fr: (2) Le paragraphe 55(3.1) de la même loi, édicté par le paragraphe (1), est abrogé.

source: (3) Subsection (1) is deemed to have come into force on the day after Budget Day.
fr_fr: (3) Le paragraphe (1) est réputé être entré en vigueur le lendemain du jour du budget.

source: (4) Subsection (2) comes into force on February 1, 2028.
fr_fr: (4) Le paragraphe (2) entre en vigueur le 1 er février 2028.
